In [1]:
import pandas as pd

In [2]:
list1=[1,2,6,8,3,7]

In [3]:
ser1=pd.Series(list1)

In [4]:
ser1

0    1
1    2
2    6
3    8
4    3
5    7
dtype: int64

In [5]:
list2=["nandu","sabeeda","hazib","anil"]

In [6]:
ser2=pd.Series(list2)

In [7]:
ser2

0      nandu
1    sabeeda
2      hazib
3       anil
dtype: object

In [8]:
import numpy as np

In [9]:
n=np.arange(4,80,4)

In [10]:
ser3=pd.Series(n)

In [11]:
ser3

0      4
1      8
2     12
3     16
4     20
5     24
6     28
7     32
8     36
9     40
10    44
11    48
12    52
13    56
14    60
15    64
16    68
17    72
18    76
dtype: int32

In [12]:
ser2

0      nandu
1    sabeeda
2      hazib
3       anil
dtype: object

In [13]:
ser2[2]

'hazib'

In [14]:
ser2[0:3]

0      nandu
1    sabeeda
2      hazib
dtype: object

In [15]:
ser2[::2]

0    nandu
2    hazib
dtype: object

In [16]:
ser4=pd.Series(list2,index=["a","b","c","d"])

In [17]:
ser4

a      nandu
b    sabeeda
c      hazib
d       anil
dtype: object

In [18]:
ser4["c"]

'hazib'

In [19]:
ser3

0      4
1      8
2     12
3     16
4     20
5     24
6     28
7     32
8     36
9     40
10    44
11    48
12    52
13    56
14    60
15    64
16    68
17    72
18    76
dtype: int32

In [20]:
ser3>20

0     False
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
15     True
16     True
17     True
18     True
dtype: bool

In [21]:
ser3[ser3>30]

7     32
8     36
9     40
10    44
11    48
12    52
13    56
14    60
15    64
16    68
17    72
18    76
dtype: int32

In [22]:
(ser3>30) & (ser3<60)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14    False
15    False
16    False
17    False
18    False
dtype: bool

In [23]:
ser3[(ser3>30) & (ser3<60)]

7     32
8     36
9     40
10    44
11    48
12    52
13    56
dtype: int32

In [24]:
ser3.min()

4

In [25]:
ser3.max()

76

In [26]:
ser3+10

0     14
1     18
2     22
3     26
4     30
5     34
6     38
7     42
8     46
9     50
10    54
11    58
12    62
13    66
14    70
15    74
16    78
17    82
18    86
dtype: int32

In [27]:
ser3*2

0       8
1      16
2      24
3      32
4      40
5      48
6      56
7      64
8      72
9      80
10     88
11     96
12    104
13    112
14    120
15    128
16    136
17    144
18    152
dtype: int32

In [28]:
ser3/2

0      2.0
1      4.0
2      6.0
3      8.0
4     10.0
5     12.0
6     14.0
7     16.0
8     18.0
9     20.0
10    22.0
11    24.0
12    26.0
13    28.0
14    30.0
15    32.0
16    34.0
17    36.0
18    38.0
dtype: float64

In [29]:
ser3-20

0    -16
1    -12
2     -8
3     -4
4      0
5      4
6      8
7     12
8     16
9     20
10    24
11    28
12    32
13    36
14    40
15    44
16    48
17    52
18    56
dtype: int32

In [30]:
name={"nandana":1,"sabith":2,"haziba":3,"anila":4}

In [31]:
marks=pd.Series(name)

In [32]:
marks

nandana    1
sabith     2
haziba     3
anila      4
dtype: int64

In [33]:
list1=["nandana","sabith","haziba","anila","anandu","gazal"]

In [34]:
marks1=pd.Series(name,index=list1)

In [35]:
marks1

nandana    1.0
sabith     2.0
haziba     3.0
anila      4.0
anandu     NaN
gazal      NaN
dtype: float64

In [36]:
marks1.isna()

nandana    False
sabith     False
haziba     False
anila      False
anandu      True
gazal       True
dtype: bool

In [37]:
marks1[marks1.isna()]

anandu   NaN
gazal    NaN
dtype: float64

In [38]:
marks1.isnull()

nandana    False
sabith     False
haziba     False
anila      False
anandu      True
gazal       True
dtype: bool

In [39]:
marks1[marks1.isnull()]

anandu   NaN
gazal    NaN
dtype: float64

In [40]:
marks1.notna()

nandana     True
sabith      True
haziba      True
anila       True
anandu     False
gazal      False
dtype: bool

In [41]:
marks1[marks1.notna()]

nandana    1.0
sabith     2.0
haziba     3.0
anila      4.0
dtype: float64

In [42]:
dict1={"name":["nandu","anil","sabeeda","hazib",],"age":[22,24,19,20],"mark1":[90,95,97,98],"mark2":[110,115,112,118]}

In [43]:
marks=pd.DataFrame(dict1)

In [44]:
marks

      name  age  mark1  mark2
0    nandu   22     90    110
1     anil   24     95    115
2  sabeeda   19     97    112
3    hazib   20     98    118

In [45]:
marks["name"]

0      nandu
1       anil
2    sabeeda
3      hazib
Name: name, dtype: object

In [46]:
marks.head(2)

    name  age  mark1  mark2
0  nandu   22     90    110
1   anil   24     95    115

In [47]:
marks.tail(2)

      name  age  mark1  mark2
2  sabeeda   19     97    112
3    hazib   20     98    118

In [48]:
marks["age"]>20

0     True
1     True
2    False
3    False
Name: age, dtype: bool

In [49]:
marks[marks["age"]>20]

    name  age  mark1  mark2
0  nandu   22     90    110
1   anil   24     95    115

In [50]:
marks[marks["name"]=="anil"]

   name  age  mark1  mark2
1  anil   24     95    115

In [51]:
marksheet=pd.DataFrame(marks,columns=["name","age","mark1","mark2","place"])

In [52]:
marksheet

      name  age  mark1  mark2  place
0    nandu   22     90    110    NaN
1     anil   24     95    115    NaN
2  sabeeda   19     97    112    NaN
3    hazib   20     98    118    NaN

In [53]:
marksheet["place"]=["palakkad","malappuaram","trissur","ernakulam"]

In [54]:
marksheet

      name  age  mark1  mark2        place
0    nandu   22     90    110     palakkad
1     anil   24     95    115  malappuaram
2  sabeeda   19     97    112      trissur
3    hazib   20     98    118    ernakulam

In [55]:
marksheet["cgpa"]=[8,7,9,6]

In [56]:
marksheet

      name  age  mark1  mark2        place  cgpa
0    nandu   22     90    110     palakkad     8
1     anil   24     95    115  malappuaram     7
2  sabeeda   19     97    112      trissur     9
3    hazib   20     98    118    ernakulam     6

In [57]:
marksheet["percentage"]=marksheet["cgpa"]*10

In [58]:
marksheet

      name  age  mark1  mark2        place  cgpa  percentage
0    nandu   22     90    110     palakkad     8          80
1     anil   24     95    115  malappuaram     7          70
2  sabeeda   19     97    112      trissur     9          90
3    hazib   20     98    118    ernakulam     6          60

In [59]:
marksheet["totalmarks"]=marksheet["mark1"]+marksheet["mark2"]

In [60]:
marksheet

      name  age  mark1  mark2        place  cgpa  percentage  totalmarks
0    nandu   22     90    110     palakkad     8          80         200
1     anil   24     95    115  malappuaram     7          70         210
2  sabeeda   19     97    112      trissur     9          90         209
3    hazib   20     98    118    ernakulam     6          60         216

In [61]:
marksheet={"name":["david","richard","john","tony","scott"],"maths":[85,91,81,84,71],"science":[87,81,86,86,79],"english":[88,78,88,87,82],"physics":[92,71,84,82,88],"general knowledge":[88,74,92,81,89]}

In [62]:
marks=pd.DataFrame(marksheet)

In [63]:
marks

      name  maths  science  english  physics  general knowledge
0    david     85       87       88       92                 88
1  richard     91       81       78       71                 74
2     john     81       86       88       84                 92
3     tony     84       86       87       82                 81
4    scott     71       79       82       88                 89

In [64]:
marks["totalmarks"]=marks["maths"]+marks["science"]+marks["english"]+marks["physics"]+marks["general knowledge"]

In [65]:
marks

      name  maths  science  english  physics  general knowledge  totalmarks
0    david     85       87       88       92                 88         440
1  richard     91       81       78       71                 74         395
2     john     81       86       88       84                 92         431
3     tony     84       86       87       82                 81         420
4    scott     71       79       82       88                 89         409

In [66]:
marks["avarage"]=marks["totalmarks"]/500

In [67]:
marks

,name,maths,science,english,physics,general knowledge,totalmarks,avarage
0,david,85,87,88,92,88,440,0.880
1,richard,91,81,78,71,74,395,0.790
2,john,81,86,88,84,92,431,0.862
3,tony,84,86,87,82,81,420,0.840
4,scott,71,79,82,88,89,409,0.818

In [68]:
marks["cgpa"]=(marks["totalmarks"]/50)

In [69]:
marks

,name,maths,science,english,physics,general knowledge,totalmarks,avarage,cgpa
0,david,85,87,88,92,88,440,0.880,8.80
1,richard,91,81,78,71,74,395,0.790,7.90
2,john,81,86,88,84,92,431,0.862,8.62
3,tony,84,86,87,82,81,420,0.840,8.40
4,scott,71,79,82,88,89,409,0.818,8.18

In [70]:
marks["percentage"]=marks["avarage"]*100

In [71]:
marks

,name,maths,science,english,physics,general knowledge,totalmarks,avarage,cgpa,percentage
0,david,85,87,88,92,88,440,0.880,8.80,88.0
1,richard,91,81,78,71,74,395,0.790,7.90,79.0
2,john,81,86,88,84,92,431,0.862,8.62,86.2
3,tony,84,86,87,82,81,420,0.840,8.40,84.0
4,scott,71,79,82,88,89,409,0.818,8.18,81.8

In [72]:
marksheet1=pd.read_excel(r"C:\Users\admin\Documents\nandu python\Mrks_data (5).xlsx")

In [73]:
marksheet1

        Name  Age        City Qualification
0       Amal    22     Kannur           PHD
1       Ammu    26       Pmna      Plus two
2       Arya    24   Thrissur        Degree
3    Sreeraj    22  Kozhikode           BBA
4  Arundathi    21        Ekm           BCA
5      Vipin    25    Shornur            BA
6     Nithin    22   Nilambur           Bsc
7      Karun    23  Kozhikode           Bsc

In [74]:
marksheet3=pd.read_excel(r"C:\Users\admin\Documents\nandu python\Mrks_data (5).xlsx",sheet_name=["DA1","DA2"])

In [75]:
marksheet3

{'DA1':         Name  Age        City Qualification
 0       Amal    22     Kannur           PHD
 1       Ammu    26       Pmna      Plus two
 2       Arya    24   Thrissur        Degree
 3    Sreeraj    22  Kozhikode           BBA
 4  Arundathi    21        Ekm           BCA
 5      Vipin    25    Shornur            BA
 6     Nithin    22   Nilambur           Bsc
 7      Karun    23  Kozhikode           Bsc,
 'DA2':       Name  Age         City Qualification
 0   Anagha    22      Kannur      Plus two
 1     Anil    20  Trivandrum        Degree
 2     Diya    25   Kozhikode           BCA
 3    Deepa    24    Palakkad           BBA
 4   Nalini    23        Pmna           MCA
 5  Adithya    22    Thrissur           PHD}

In [76]:
iris=pd.read_excel(r"C:\Users\admin\Documents\nandu python\iris (2).xls")

In [77]:
iris

      SL   SW   PL   PW  Classification
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    NaN  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  NaN  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [78]:
iris.head(10)

    SL   SW   PL   PW Classification
0  5.1  3.5  1.4  0.2    Iris-setosa
1  4.9  3.0  1.4  0.2    Iris-setosa
2  NaN  3.2  1.3  0.2    Iris-setosa
3  4.6  3.1  1.5  0.2    Iris-setosa
4  5.0  3.6  1.4  0.2    Iris-setosa
5  5.4  3.9  1.7  0.4    Iris-setosa
6  4.6  3.4  1.4  0.3    Iris-setosa
7  5.0  3.4  1.5  0.2    Iris-setosa
8  4.4  2.9  1.4  0.2    Iris-setosa
9  4.9  3.1  1.5  0.1    Iris-setosa

In [79]:
iris.tail(10)

      SL   SW   PL   PW  Classification
140  6.7  3.1  5.6  2.4  Iris-virginica
141  NaN  3.1  5.1  2.3  Iris-virginica
142  5.8  2.7  5.1  1.9  Iris-virginica
143  6.8  3.2  5.9  2.3  Iris-virginica
144  6.7  3.3  5.7  2.5  Iris-virginica
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  NaN  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

In [80]:
iris.isna().sum()

SL                7
SW                6
PL                6
PW                0
Classification    0
dtype: int64

In [81]:
iris[iris["SL"].isna()]

     SL   SW   PL   PW   Classification
2   NaN  3.2  1.3  0.2      Iris-setosa
21  NaN  3.7  1.5  0.4      Iris-setosa
39  NaN  3.4  1.5  0.2      Iris-setosa
51  NaN  3.2  4.5  1.5  Iris-versicolor
85  NaN  3.4  4.5  1.6  Iris-versicolor
106 NaN  2.5  4.5  1.7   Iris-virginica
141 NaN  3.1  5.1  2.3   Iris-virginica

In [82]:
iris[iris["SW"].isna()]

      SL  SW   PL   PW   Classification
10   5.4 NaN  1.5  0.2      Iris-setosa
27   5.2 NaN  1.5  0.2      Iris-setosa
43   5.0 NaN  1.6  0.6      Iris-setosa
72   6.3 NaN  4.9  1.5  Iris-versicolor
98   5.1 NaN  3.0  1.1  Iris-versicolor
124  6.7 NaN  5.7  2.1   Iris-virginica

In [83]:
iris[iris["PL"].isna()]

      SL   SW  PL   PW   Classification
28   5.2  3.4 NaN  0.2      Iris-setosa
42   4.4  3.2 NaN  0.2      Iris-setosa
56   6.3  3.3 NaN  1.6  Iris-versicolor
94   5.6  2.7 NaN  1.3  Iris-versicolor
109  7.2  3.6 NaN  2.5   Iris-virginica
147  6.5  3.0 NaN  2.0   Iris-virginica